--Лабораторна робота №1
--студентки групи КН-31 підгрупа 1
--Ківачук Інна
--Варіант 7

--Завдання 1. Навести приклади виразу типу (String, ([Bool], [Integer]))
--("abcd", ([True, False],[1,2,3,4]))
--("a", ([1==1,2/=2],[1])) 
--("Inna", ([2>3 && 4<6],[-1,-2])) 

--Завдання 2. Функцiя приймає два числа i перевiряє, чи вони впорядкованi за зростанням.

f1 :: (Integer, Integer) -> Bool
f1 (x,y) = x < y

f2 :: Integer -> Integer -> Bool
f2 x y = x < y

--Висновок: В ході лабораторної роботи ми навчились працювати з найпростішими функціями та інтерпретатором ghci. Визначили функцію, яка перевіряє, чи впорядковані два числа за зростанням.