{-# OPTIONS_GHC -Wno-incomplete-patterns #-}
--Лабораторна робота №2
--студентки групи КН-31 підгрупа 1
--Ківачук Інна
--Варіант 7

--Завдання 1. Послiдовнiсть тотожних елементiв списку замiнити одним елементом,напр.: [1,1,1,5,5,3, 1,1,222,222,222,222] ) [1,5,3,1,222].

f1 :: Eq a => [a] -> [a]
f1 [] = []
f1 [x] = [x]
f1 (x1:x2:xs) = if x1 == x2 then f1(x2:xs) else x1:f1(x2:xs)
--Результат: f1 [1,1,1,2,1,22,22,3] - > [1,2,1,22,3]


f1_2:: (Eq a) => [a] -> [a] 
f1_2 (x:xs)
  | xs == []       = [x]
  | x == head (xs) = f1_2 xs
  | otherwise      = x : f1_2 xs
--Результат: f1_2 [1,1,1,2,1,22,22,3] - > [1,2,1,22,3]

--Завдання 2. Визначити, чи два числа взаємно простi.
gcd' :: (Integer, Integer) -> Integer
gcd' (x1, 0)  =  x1
gcd' (x1, x2) =  gcd' (x2, (x1 `mod` x2))

f2 :: (Integer, Integer) -> Bool
f2 (x1,x2) = gcd' (x1, x2) == 1
--Результат: f2 (2,4) - > False
-- f2 (2,3 - > True

f2_2 :: (Integer, Integer) -> Bool
f2_2 (x1,x2) = gcd x1 x2 ==1
--Результат: f2_2 (2,4) - > False
-- f2_2 (2,3 - > True



